[
  {
    "id": "1",
    "title": "Senior Engineer, Data Infrastructure",
    "company": "StraitsX",
    "tagline": "MAS-licensed stablecoin infrastructure — issuer of XSGD & XUSD for cross-border payments across ASEAN.",
    "type": "work",
    "startDate": "2024-05",
    "endDate": null,
    "description": "Building and maintaining data infrastructure powering real-time and batch analytics across the organization.",
    "bullets": [
      "Replaced expensive batch RDS snapshot ingestion with real-time CDC → BigQuery across 800+ PostgreSQL/MySQL tables, improving data latency while reducing monthly spend by $8,000.",
      "Upgraded Airflow from Composer 2 to Composer 3, modernizing Python runtimes and system packages while maintaining backward compatibility for 100+ DAGs.",
      "Led cost observability initiative — implemented monitoring dashboards and review cycles, reducing BigQuery slot usage by 527 hours/day and saving $1.5K/month via table partitioning.",
      "Deployed Apache Spark on GCP to enable DBT Python models, unlocking flexible transformation logic previously impossible due to BigQuery's SQL-only limitation."
    ],
    "tags": ["BigQuery", "CDC", "Airflow", "Apache Spark", "dbt", "GCP"]
  },
  {
    "id": "2",
    "title": "L4 Data Infrastructure Engineer",
    "company": "Xendit",
    "tagline": "Southeast Asia's leading payment infrastructure unicorn (YC W15), powering 100+ payment methods across Indonesia, Philippines, and beyond.",
    "type": "work",
    "startDate": "2022-10",
    "endDate": "2024-03",
    "description": "Led infrastructure-level data platform work: cost optimization, real-time processing, and tooling for data science teams.",
    "bullets": [
      "Achieved $7,400/month cost reduction by analyzing network traffic with Datadog and migrating Trino on Kubernetes from multizone to active-standby architecture.",
      "Improved clickstream analysis by migrating from batch to real-time with Kafka, Spark Streaming, and Databricks.",
      "Created Databricks notebook templates with integrated MLflow tracking, enabling data scientists to rapidly prototype and monitor experiments.",
      "Built a custom Trino logging plugin in Java to track query ownership and identify high-cost users."
    ],
    "tags": ["Trino", "Kubernetes", "Kafka", "Spark Streaming", "Databricks", "Datadog", "Java"]
  },
  {
    "id": "3",
    "title": "L3 Data Engineer",
    "company": "Xendit",
    "type": "work",
    "startDate": "2021-10",
    "endDate": "2022-09",
    "description": "Designed ingestion frameworks and data transformation pipelines, with focus on reliability and self-service for data consumers.",
    "bullets": [
      "Developed a config-driven ingestion framework (Strategy pattern + FastAPI) integrating 10+ sources: PostgreSQL, MongoDB, Jira, Zendesk, CleverTap, and Facebook Ads.",
      "Reduced manual COGS calculation from 3 days to under 1 hour by implementing Slowly Changing Dimension (SCD) logic in dbt models.",
      "Applied IaC with Terraform to automate provisioning of Spark clusters and AWS IAM roles, ensuring environment parity."
    ],
    "tags": ["Python", "FastAPI", "dbt", "Terraform", "Spark", "PostgreSQL", "MongoDB"]
  },
  {
    "id": "4",
    "title": "L2 Junior Data Engineer",
    "company": "Xendit",
    "type": "work",
    "startDate": "2021-03",
    "endDate": "2021-09",
    "description": "Contributed to platform reliability and code quality initiatives on the data engineering team.",
    "bullets": [
      "Consolidated 2,000+ lines of user-contributed PySpark code from Databricks notebooks into a shared library.",
      "Developed CI/CD validation for dbt and Looker to enforce partitioning standards and prevent inefficient deployments."
    ],
    "tags": ["PySpark", "Databricks", "dbt", "Looker", "CI/CD"]
  },
  {
    "id": "5",
    "title": "B.S. in Computer Science",
    "company": "Bandung Institute of Technology",
    "type": "education",
    "startDate": "2017-08",
    "endDate": "2021-10",
    "description": "Focused on algorithms, data structures, and software engineering fundamentals.",
    "bullets": [
      "Lab Assistant: KU1102 — Introduction to Information Technology (2019)"
    ],
    "tags": ["Algorithms", "Data Structures", "Computer Science"]
  }
]
