[
  {
    "id": "1",
    "title": "Software Engineer — Data Platform",
    "company": "Tech Company",
    "type": "work",
    "startDate": "2023-01",
    "endDate": null,
    "description": "Building and maintaining core data platform infrastructure that powers analytics, ML pipelines, and real-time reporting across the organization.",
    "bullets": [
      "Designed and operated a real-time ingestion pipeline with Apache Flink processing 500k+ events/sec",
      "Migrated batch ETL workloads from Hive to Spark on Databricks, cutting job runtimes by 60%",
      "Deployed and tuned ClickHouse cluster for OLAP queries serving product analytics dashboards"
    ],
    "tags": ["Python", "Apache Flink", "Spark", "ClickHouse", "Kubernetes"]
  },
  {
    "id": "2",
    "title": "Data Engineer Intern",
    "company": "E-commerce Platform",
    "type": "work",
    "startDate": "2022-06",
    "endDate": "2022-12",
    "description": "Contributed to the data warehouse and pipeline infrastructure team. Focused on improving data reliability and query performance.",
    "bullets": [
      "Built dbt models and tests to standardize 30+ core business metrics across the warehouse",
      "Optimized BigQuery queries reducing monthly compute cost by 25%",
      "Developed Airflow DAGs to orchestrate daily and hourly data refresh pipelines"
    ],
    "tags": ["Python", "SQL", "BigQuery", "dbt", "Airflow"]
  },
  {
    "id": "3",
    "title": "Bachelor of Computer Science",
    "company": "University of Technology",
    "type": "education",
    "startDate": "2019-08",
    "endDate": "2023-05",
    "description": "Focused on algorithms, data structures, databases, and distributed systems. Final thesis on query optimization for analytical workloads.",
    "bullets": [
      "GPA: 3.8/4.0, Dean's List for 4 semesters",
      "Thesis: Cost-based query optimization techniques for distributed SQL engines",
      "Teaching Assistant for Database Systems course"
    ],
    "tags": ["Algorithms", "Databases", "Distributed Systems"]
  },
  {
    "id": "4",
    "title": "Open Source Contributor",
    "company": "Various Projects",
    "type": "work",
    "startDate": "2021-01",
    "endDate": null,
    "description": "Active contributor to open source data tooling projects. Focus on query engines, data connectors, and infrastructure tooling.",
    "bullets": [
      "Contributed connector improvements to Trino open-source project",
      "Maintained a Python library for ClickHouse schema management with 300+ GitHub stars",
      "Regular participant in data engineering community discussions and meetups"
    ],
    "tags": ["Python", "Trino", "ClickHouse", "Open Source"]
  }
]
